// 004_c++_bit.cpp : 定义控制台应用程序的入口点。
// 位运算的逻辑& | ~,是把数转化为二进制后，再将每一位进行对比运算，然后得出最后结果

#include "stdafx.h"
#include <iostream>
using namespace std;
int main()
{

	// 运算5 & 3
	int a = 5, b = 3; // 二进制a=101 b = 011(前面位数不够补0) 101&011 = 1
	cout << (a&b) << endl; // 得到结果是1
	cout << (a|b) << endl; // 得到结果是6， 101&011 = 111 = 7
	cout << (~a) << endl; // 0000000000000101取反，得到1111111111111010，转化为十进制的时候要取补码 = -6

	cout << (a << 2) << endl; // 101左移两位得到10100 = 20
	cout << (a >> 2) << endl; // 101右移两位得到1 = 1
    return 0;
}

